
public class GSM {
	/*
	 * model – модел на телефона hasSimCard – дали в телефона е заредена SIM
	 * карта simMobileNumber – номер на SIM картата(телефонен номер), ако е
	 * заредена такава. outgoingCallsDuration – общото време (в минути) на
	 * изходящите повиквания lastIncomingCall – последното входящо повикване
	 * lastOutgoingCall – последното изходящо повикване
	 */
	String model;
	boolean hasSimCard;
	String simMobileNumber;
	double outgoingCallsDuration;
	double lastIncomingCall;
	double lastOutgoingCall;

	/*
	 * Да се напишат следните методи за класа GSM: -
	 * insertSimCard(simMobileNumber) – метода задава номер(сим карта) на
	 * телефона. Да се провери дали подаденият номер е валиден (започва с 08 и
	 * се състои от 10 цифри). Ако номерът е валиден, го задава на телефона и
	 * задава стойност true на полето hasSimCard - removeSimCard() - премахва
	 * сим картата от телефона (задава false на полето hasSimCard) - call(
	 * receiver, duration) – В тялото му да се направят проверки за: • дали
	 * въведената дължина на разговора е валидна • дали двата телефона (този за
	 * който се извиква метода и този към който се прави обаждането) не са един
	 * и същ телефон • дали и двата телефона имат сим карта Ако всички проверки
	 * преминат успешно, метода прави обаждане с продължителност duration към
	 * телефона, подаден като параметър. Задава това обаждане като последно
	 * изходящо повикване на телефона от който се прави повикването (телефона за
	 * който се извиква метода) и задава същото обаждане като последно входящо
	 * за телефона към който се прави обаждането. Осен това увеличава стойността
	 * на outgoingCallsDuration със дължината на разговора за телефона от който
	 * се прави обаждането. Да се направи и метод getSumForCall(), който връща
	 * сумата, начислена за изходящите повиквания на телефона (общото време на
	 * изходящите повиквания по цената за минута - priceForAMinute).
	 * 
	 */

}
