package traders;
/*
ITTalents Training Camp Season 5
Test 2
Object-oriented programming
Реализирайте структура от класове, която да представлява работата на търговци в
София.
Всеки търговец съдържа в себе си следните характеристики:
• Наименование
• Адрес на регистрация
• Капитал – начална сума за започване на бизнес.
• Търговски обект, където оперира (един или няколко)
• Доставчик, от който зарежда стоки (един или няколко)
Търговските обекти съдържат следните характеристики:
• адрес
• работно време
• площ
• данък към държавата.
Доставчиците съдържат следните характеристики:
• наименование
• адрес
• работно време
Доставчиците могат да бъдат на дребно и на едро. Доставчиците на стоки на едро
имат отстъпка от 15 процента от цената на всички стоки.
Търговски обекти биват:
1. сергия на пазара – площ между 2 и 10 квадратни метра. Годишен данък
към държавата в размер на 50 лева.
2. магазин в мола – площ между 10 и 100 квадратни метра. Годишен данък
към държавата в размер на 150 лева.
3. будка на улицата – площ между 4 и 6 квадратни метра. Годишен данък към
държавата в размер на 50 лева.
В София оперират различни видове търговци:
• Амбулантен търговец – той не оперира в определен търговски обект и
работи с един доставчик на дребно.
• ЕТ – едноличен търговец – той оперира само с доставчици на дребно (не
повече от 5) и притежава един търговски обект. ЕТ може да притежава
бутка на улицата или сергия на пазара.
• Търговска верига – работи с много доставчици на дребно и на едро (не
повече от 15) и има много търговски обекти (не повече от 10). Притежава
както будки, така и магазини в моловете.
Всеки търговец може да изпълнява следните действия:
• да прави поръчка на определена стойност към доставчик. Поръчката не
може да надвишава 50% от капитала на търговеца. Ако доставчика
направи отстъпка, разликата в парите да се върне обратно на търговеца.
При поръчка на стоки от доставчик, търговеца приема в търговския обект
списък с произволно генериран брой продукти, като всеки продукт има
наименование и произволна цена между 5 и 15 лева. Общата цена на
продуктите представлява стойността на доставката.
• да прибира оборот от търговския обект – 130% от стойността на
поръчаните стоки. (дефакто търговците имат 30% надценка). Оборотът
представлява печалбата от произволен брой продадени артикули.
• да плаща данъци на държавата за съответния търговски обект.
Да се реализира демо, което:
1. Създава 10 доставчика на произволен принцип – на дребно и на едро.
2. Създава 20 търговски обекта на произволен принцип – сергии, магазини и
будки.
3. Създава един амбулантен търговец с капитал 100 лева, един ЕТ с капитал
500 лева и една търговска верига с капитал 3000 лева.
4. Подава на търговците съответни търговски обекти на произволен
принцип.
5. Да се извика метод, който приема списък от създадените търговци и за
всеки търговец се започва търговска дейност. Търговската дейност
представлява:
◦ поръчка на стоки от доставчик за всеки търговски обект. Да се извежда
на екрана списъка със стоки, сортиран по цена в нарастващ ред.
◦ прибиране на оборот от всеки търговски обект – да се извежда на
екрана общата сума на печалбата. След продажба списъкът с
останалите стоки в магазина трябва отново да е сортиран по цена.
◦ плащане на месечен данък към държавата за всеки търговски обект.
6. Да се изпише текущия паричен баланс на всеки обект след упражняването
на търговска дейност.
7. Да се изведе търговецът с най-голям брой продадени стоки за месеца.
8. Да се изведе търговецът с най-голям размер на изплатения данък към
държавата.
Оценяване:
Реализирането на всички връзки между класовете, абстракция, капсулация и
наследяване – 15 т.
За правилното реализиране на класовата структура за търговци – 10т.
За правилното реализиране на класовата структура за търговски обекти – 10т.
За правилното реализиране на класовата структура за доставчици – 10т.
За правилното реализиране на функционалността по демото – 5 т. за всяка
подточка от демото, 15 т. - за подточка 5 от демото.
*/